In [2]:
import pandas as pd
import numpy as np

In [38]:
# 5.1 값 변경
# 1) 기본 변경
# 특정 행, 열을 뽑아 낼 때 사용하는 df.loc

In [75]:
# 데이터프레임 만들기
dict = {'이름': ['주해람', '장혜리', '신동하', '연제은'],
       '등급': ['Gold', 'Bronze', 'Silver', 'Gold'],
       '점수': [56000, 23000, 44000, 52000]}

df = pd.DataFrame(dict, index=['1번', '2번', '3번', '4번'])
df

     이름      등급     점수
1번  주해람    Gold  56000
2번  장혜리  Bronze  23000
3번  신동하  Silver  44000
4번  연제은    Gold  52000

In [13]:
# 점수 열에 10 곱하기
df['점수'] = df['점수']*10
df

     이름      등급      점수
1번  주해람    Gold  560000
2번  장혜리  Bronze  230000
3번  신동하  Silver  440000
4번  연제은    Gold  520000

In [76]:
# 이름 열 변경
df['이름'] = df['이름'] + '님'
df

     이름       등급     점수
1번  주해람    Gold님  56000
2번  장혜리  Bronze님  23000
3번  신동하  Silver님  44000
4번  연제은    Gold님  52000

In [15]:
# 두번째 행, 첫 번째 열의 이름 바꾸기
df.loc['2번', '이름'] = '박은하님'
df

      이름      등급      점수
1번  주해람님    Gold  560000
2번  박은하님  Bronze  230000
3번  신동하님  Silver  440000
4번  연제은님    Gold  520000

In [19]:
# 1번 ~ 3번 점수를 모두 0으로 변경
df.loc['1번':'3번', '점수'] = 0
df

      이름      등급      점수
1번  주해람님    Gold       0
2번  박은하님  Bronze       0
3번  신동하님  Silver       0
4번  연제은님    Gold  520000

In [31]:
# 1번 ~ 3번 점수를 각각 10000, 20000, 30000으로 변경
df.loc['1번':'3번', '점수'] = [10000, 20000, 30000]
df

      이름     등급      점수
1번  주해람님  10000   10000
2번  박은하님  20000   20000
3번  신동하님  30000   30000
4번  연제은님   Gold  520000

In [33]:
# 1번 ~ 3번 등급과 점수를 모두 NaN으로 변경
df.loc['1번':'3번', ['등급','점수']] = np.nan
df

     이름    등급       점수
1번  주해람   NaN      NaN
2번  장혜리   NaN      NaN
3번  신동하   NaN      NaN
4번  연제은  Gold  52000.0

In [78]:
# 1번 ~ 3번 모두 등급은 NaN, 점수는 0으로 변경
df.loc['1번':'3번', ['등급','점수']] = [np.nan, 0]
df

     이름     등급     점수
1번  주해람    NaN      0
2번  장혜리    NaN      0
3번  신동하    NaN      0
4번  연제은  Gold님  52000

In [36]:
# 1번 ~ 3번 등급과 점수를 지정한 값으로 각각 변경
df.loc['1번':'3번', ['등급','점수']] = [['Gold', 56000], ['Bronze', 23000], ['Silver', 44000]]
df

     이름      등급       점수
1번  주해람    Gold  56000.0
2번  장혜리  Bronze  23000.0
3번  신동하  Silver  44000.0
4번  연제은    Gold  52000.0

In [37]:
# 2) map() 메소드 사용
# map() 메소드를 사용하면 범주형 데이터를 다른 값으로 쉽게 변경할 수 있음
# 단, 하나의 열에 대해서만 사용할 수 있음

In [40]:
# 데이터프레임 만들기
dict = {'이름': ['주해람', '장혜리', '신동하', '연제은'],
        '가입일': ['2019-01-15', '2019-05-01', '2020-01-15', '2020-02-12'],
        '등급': ['Gold', 'Bronze', 'Silver', 'Gold'],
        '점수': [56000, 23000, 44000, 52000]}

df = pd.DataFrame(dict, index=['1번', '2번', '3번', '4번'])
df

     이름         가입일      등급     점수
1번  주해람  2019-01-15    Gold  56000
2번  장혜리  2019-05-01  Bronze  23000
3번  신동하  2020-01-15  Silver  44000
4번  연제은  2020-02-12    Gold  52000

In [41]:
# 경우에 따른 값 변경
df['등급'] = df['등급'].map({'Gold': 'Diamond', 'Silver': 'Emerald', 'Bronze': 'Garnet'})
df

     이름         가입일       등급     점수
1번  주해람  2019-01-15  Diamond  56000
2번  장혜리  2019-05-01   Garnet  23000
3번  신동하  2020-01-15  Emerald  44000
4번  연제은  2020-02-12  Diamond  52000

In [43]:
# 5.2 열 이름 변경
# 기존 데이터프레임의 열 이름을 적절히 변경해야 할 경우가 있음
# 또는 집계 결과를 가진 열 이름을 이해하기 쉽게 변경해야 할 경우가 있음

In [45]:
# 데이터프레임 만들기
dict = {'Name': ['주해람', '장혜리', '신동하', '연제은'],
        'Level': ['Gold', 'Bronze', 'Silver', 'Gold'],
        'Score': [56000, 23000, 44000, 52000]}

df = pd.DataFrame(dict, index=['1번', '2번', '3번', '4번'])
df

   Name   Level  Score
1번  주해람    Gold  56000
2번  장혜리  Bronze  23000
3번  신동하  Silver  44000
4번  연제은    Gold  52000

In [46]:
# 1) 모든 열 이름 변경
df.columns = ['이름', '등급', '점수']
df

     이름      등급     점수
1번  주해람    Gold  56000
2번  장혜리  Bronze  23000
3번  신동하  Silver  44000
4번  연제은    Gold  52000

In [48]:
# 2) 일부 열 이름 변경
df.rename(columns = {'이름': 'Name'}, inplace = True)
df

   Name      등급     점수
1번  주해람    Gold  56000
2번  장혜리  Bronze  23000
3번  신동하  Silver  44000
4번  연제은    Gold  52000

In [49]:
# 5.3 열 추가
# 기존 데이터에서 계산 된 결과값을 저장하기 위해 새로운 열 추가

In [50]:
# 데이터프레임 만들기
dict = {'이름': ['주해람', '장혜리', '신동하', '연제은'],
        '등급': ['Gold', 'Bronze', 'Silver', 'Gold'],
        '점수': [56000, 23000, 44000, 52000]}

df = pd.DataFrame(dict, index=['1번', '2번', '3번', '4번'])
df

     이름      등급     점수
1번  주해람    Gold  56000
2번  장혜리  Bronze  23000
3번  신동하  Silver  44000
4번  연제은    Gold  52000

In [52]:
# 1) 맨 뒤에 열 추가
# 없는 열을 변경하면 그 열이 추가 됨
# 이 때 무조건 맨 뒤 열로 추가 됨
df['포인트2'] = 0
df

     이름      등급     점수  포인트2
1번  주해람    Gold  56000     0
2번  장혜리  Bronze  23000     0
3번  신동하  Silver  44000     0
4번  연제은    Gold  52000     0

In [57]:
# 2) 지정 위치에 열 추가
# insert() 함수를 사용하면 원하는 위치에 열을 추가할 수 있음
# allow_duplicates 옵션으로 같은 이름의 열이 있을 경우 추가할지 여부를 지정할 수 있음
df.insert(3, '포인트1', 0, allow_duplicates = False)
df

     이름      등급  포인트1  포인트1     점수  포인트2
1번  주해람    Gold     0     0  56000     0
2번  장혜리  Bronze     0     0  23000     0
3번  신동하  Silver     0     0  44000     0
4번  연제은    Gold     0     0  52000     0

In [58]:
# 추가된 열에 계산 값 넣기
df['포인트1'] = df['점수'] * 0.01
df['포인트2'] = df['포인트1'] * 0.1
df

     이름      등급   포인트1   포인트1     점수  포인트2
1번  주해람    Gold  560.0  560.0  56000  56.0
2번  장혜리  Bronze  230.0  230.0  23000  23.0
3번  신동하  Silver  440.0  440.0  44000  44.0
4번  연제은    Gold  520.0  520.0  52000  52.0

In [62]:
# 3) 계산된 값을 갖는 열 추가
# 열을 추가한 후 그 열에 계산 결과를 넣은 방법보다 더 간결
df['포인트3'] = df['포인트2'] * 0.1
df

     이름      등급   포인트1   포인트1     점수  포인트2  포인트3
1번  주해람    Gold  560.0  560.0  56000  56.0   5.6
2번  장혜리  Bronze  230.0  230.0  23000  23.0   2.3
3번  신동하  Silver  440.0  440.0  44000  44.0   4.4
4번  연제은    Gold  520.0  520.0  52000  52.0   5.2

In [63]:
# 5.4 열 삭제
# 분석에 의미가 없는 불필요한 열 제거

In [72]:
# 데이터프레임 만들기
dict = {'이름': ['주해람', '장혜리', '신동하', '연제은'],
        '성별': ['남', '여', '남', '여'],
        '나이': [25, 27, 31, 26],
        '등급': ['Gold', 'Bronze', 'Silver', 'Gold'],
        '점수': [56000, 23000, 44000, 52000]}

df = pd.DataFrame(dict, index=['1번', '2번', '3번', '4번'])
df

     이름 성별  나이      등급     점수
1번  주해람  남  25    Gold  56000
2번  장혜리  여  27  Bronze  23000
3번  신동하  남  31  Silver  44000
4번  연제은  여  26    Gold  52000

In [73]:
# 1) 열 하나 삭제
# drop() 메소드로 열 삭제
# axis = 0: 행 삭제(기본값)
# axis = 1: 열 삭제
df.drop('성별', axis = 1, inplace = True)
df

     이름  나이      등급     점수
1번  주해람  25    Gold  56000
2번  장혜리  27  Bronze  23000
3번  신동하  31  Silver  44000
4번  연제은  26    Gold  52000

In [74]:
# 2) 여러 열 삭제
df.drop(['나이', '등급'], axis = 1, inplace = True)
df

     이름     점수
1번  주해람  56000
2번  장혜리  23000
3번  신동하  44000
4번  연제은  52000

In [ ]:
# 실습
# 1. 아래 데이터프레임의 열 이름들을 모두 영어로 변경하세요
# 2. 게임을 하는데 가장 많은 시간과 돈을 투자한 회원을 한 눈에 보여주는 열을 추가하세요
#    열 이름은 '우수 회원'으로 설정, 계산 방법: '현금 투자' + '시간'
# 3. 게임 개편으로 등급 이름이 모두 바뀌고 모든 회원의 점수는 동일하게 0 점이 되었다.
#    알맞게 데이터 프레임을 수정해주세요. 
#    Bronze -> 새싹, Silver -> 나무, Gold -> 숲 

dict = {'이름': ['주해람', '장혜리', '신동하', '연제은'],
        '성별': ['남', '여', '남', '여'],
        '등급': ['Gold', 'Bronze', 'Silver', 'Gold'],
        '점수': [56, 23, 44, 52], 
        '현금 투자': [90000, 0, 5000, 0],
        '시간':[23, 42, 19, 90]}

df = pd.DataFrame(dict, index=['1번', '2번', '3번', '4번'])
df